
// OUR QUOTES ENGINE DATABASE (HAHAHA) ..
const QuotesDb = [
  "ዉሸታም ሰው ማስታወሻው ጣቃ ነው!",
  "ካረገዱ ማልቀስ. . .ከጀመሩ መጨረስ!",
  "ድንቁርና ከልብ መሃል ተራራ ያህል!",
  "ዲንጋይ ሲያረጅ መጭ ያበቅላል!",
  "የአባይ ዉሃ አይገደብም!",
  "አይን የማያየው ልብ የማይስተው እውነት አለ",
  "አይኗን ቢያጠፏት ቅንድቤን አለች!",
  "አምላክን ሳይጨምር የቆጠረ፤ ሁሌ ሲቆጥር ይኖራል",
  "ሁለት እግር አለኝ ተብሎ ሁለት ዛፍ አይወጣም!",
  "ከወረኛ ጎበዝ ዝምተኛ ፈሪ ይሻላል",
  "ከማያውቁት መልአክ የሚያውቁት ሰይጣን ይሻላል",
  "ከሞኝ ከመማከር ከብልህ መቸገር",
  "ከሩቅ ዘመድ የቅርብ ጎረቤት",
  "አውቆ የተኛ ቢቀሰቅሱት አይሰማም",
  "የአህያ ባል ከጅብ አያስጥልም",
  "ያለ ሴት ቤት ያለ በሬ መሬት",
  "ተገርፎ ማያውቅ ልጅ ሲቆጡት ያለቅሳል",
  "መከራና ጉም እያደር ይቀላል",
  "ለላም ቀንዷ አይከብዳትም",
  "ለመስማት የፈጠንክ ለመናገር የዘገየክ ሁን",
  "ለቅናት የለዉም ጥናት",
  "ለቅዘን እግር አይነሳም",
  "ፈስ ያለበት ዝላይ አይችልም",
  "ለአፍ ዳገት የለውም",
  "መልካም ሚስት ለባሏ ዘውድ ናት!",
  "መልካም ተመኝ መልካም እንድታገኝ",
  "መልክ ታጥቦ አይጠጣም",
  "ምጽዋት ያድናል ከጸጸት",
  "መናገር ብር ነው ዝምታ ወርቅ ነው",
  "ማልዳ የምትለቅምን ዶሮ ጭልፊት አትጠልፋትም",
  "ሞት እና እድሜ ቢፈሩት አይቀርም",
  "የገበያ ሽብር ለሌባ ድግስ ነው",
  "ጀግና የሚታወሰው ወይ ከተለየ ወይ ከሞተ ነው",
  "ጅብን ለመግደል በአህያ ተጠለል",
  "ጥሩ ወዳጅ ጥሩ ጠላት ይሆናል",
  "ጥንብ ባለበት ቁራ ይዞራል",
  "ጫማ ምንም ወርቅ ቢሆን ከእግር በታች ነው",
  "ፈሪ በራሱ ጠብ ገላጋይ ይሆናል",
  "ሆድ ሲሞላ ጭንቅላት ባዶ ይቀራል",
  "ሆድ ያባውን ብቅል ያወጣዋል",
  "ለሞኝ ጥርስህን ለዝንብ ቁስልህን አታሳይ",
  "ለባለጌ ገድሉ ዉርደቱ",
  "ላለፈ ክረምት ቤት አይሰራለትም",
  "ቀበጥ እውር ከመሪው ይጣላል",
  "ያልታደለ አሞራ ፈረስ የሞተ ቀን አይኑ ይታወራል",
  "ሃረግ ቢረዝም ማእገር አይሆንም",
  "ቁንጥጫ ይሻላል ከግልምጫ",
  "ቁጥቋጦ ሲያድግ ዛፍ ይሆናል",
  "ቂል ሲረግሙት የመረቁት ይመስለዋል",
  "በመስከረም የሚያብድ በሰኔ ሱሪውን ከፍ ከፍ ያደርጋል",
];

// GABING THE HTML EL FOR MORE MANIPULATION
// EL
const Quote = document.getElementById("Quotes");
const GenerateQBtn = document.getElementById("GenerateBtn");

function GenerateQuotes(Quotes) {
  let New_Quotes = "";

  for (let i = 0; i < Quotes.length; i++) {
    let GenQuotes = Math.floor(Math.random() * Quotes.length);
    New_Quotes = Quotes[GenQuotes];
  }

  return New_Quotes;
}

GenerateQBtn.addEventListener("click", () => {
  let NewQuotes = GenerateQuotes(QuotesDb);
  Quote.textContent = NewQuotes;
});
